In [1]:
# データ分析用のライブラリ
import pandas as pd
import numpy as np

import re

#### 適当なデータフレーム作成

In [2]:
c_dict ={
    'T番号':['0000111-1234567', '0000222-2345678', '0000333-3456789'],
    'company':['A', 'B', 'C']
}

c_df = pd.DataFrame(c_dict)
c_df

               T番号 company
0  0000111-1234567       A
1  0000222-2345678       B
2  0000333-3456789       C

## [T番号]カラムの全レコードに対しスライスを使い該当文字列部分のみ取得
先頭の0000を除外

In [3]:
c_df['T番号'] = c_df['T番号'].apply(lambda x: x[4:])
c_df

           T番号 company
0  111-1234567       A
1  222-2345678       B
2  333-3456789       C

## [T番号]カラムの全レコードに対し文字列「-」(ハイフン)を削除

In [4]:
c_df['T番号'] = c_df['T番号'].apply(lambda x: x.replace('-', ''))
c_df

          T番号 company
0  1111234567       A
1  2222345678       B
2  3333456789       C

#### 別のデータフレーム作成

In [5]:
z_dict ={
    'TN番号':['0111', '0222', '0333'],
    'cus番号':['1234567', '2345678', '3456789'],
    'company2':['A', 'B', 'C']
}

z_df = pd.DataFrame(z_dict)
z_df

   TN番号 company2    cus番号
0  0111        A  1234567
1  0222        B  2345678
2  0333        C  3456789

## [TN番号]カラムの全レコードに対しスライスを使い該当文字列部分のみを取得
先頭の0を除外

In [6]:
z_df['TN番号'] = z_df['TN番号'].apply(lambda x: x[1:])
z_df

  TN番号 company2    cus番号
0  111        A  1234567
1  222        B  2345678
2  333        C  3456789

### 複数列の文字列同士を結合して新たな列を生成

In [7]:
z_df['T番号'] = z_df['TN番号'] + z_df['cus番号']
z_df

  TN番号 company2    cus番号         T番号
0  111        A  1234567  1111234567
1  222        B  2345678  2222345678
2  333        C  3456789  3333456789

### 2つのファイルを連結

In [8]:
merge_df = pd.merge(c_df, z_df, on='T番号', how='left')
merge_df

          T番号 company TN番号 company2    cus番号
0  1111234567       A  111        A  1234567
1  2222345678       B  222        B  2345678
2  3333456789       C  333        C  3456789

In [9]:
merge_df.isnull().any()

T番号         False
company     False
TN番号        False
company2    False
cus番号       False
dtype: bool